<?php

// 陣列宣告方式

//$a=array();
//$a=[1,2,3,4];
//$a=["小明"=>12,"小華"=>23, "小強"=>30, "阿國"=>42];
$a[]=11;
$a[]=22;
$a[]=33;

$a["小明"]=44;
$a[55]="小華";


echo "<pre>" ;print_r($a);"</pre>";
echo $a["小明"];
echo "<hr>";
// 陣列的維度
//$a=[[1,2,3],[4,5,6],[7,8,9]]
$a=[
    "小明"=>["國文"=>90, "英文"=>80,"歷史"=>33],
    "小華"=>["國文"=>32, "英文"=>60, "數學"=>77],

];

echo "<pre>";print_r($a);"</pre>";

// 陣列函式
echo "count(\$a)=>";
echo count($a);
echo "<hr>";
echo "is_array(\$a)=>";
echo is_array($a);
echo "<hr>";
echo "in_array(\$a)=>";
echo in_array(["國文"=>90, "英文"=>80, "歷史"=>33],$a);
echo "<hr>";
$num=array_search(["國文"=>90, "英文"=>80,"歷史"=>33],$a);
echo "座號: " . $num;



?>