<h4>天干地支年別</h4>
<hr>
<?php
    $start=1024;

   $sky=[
        "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸",
   ];
    $land=[
        '子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥',
    ];
    $year=2020;

    $arr=[];
    for ($i=1024; $i < 3000; $i++) { 
        // $arr[]=$i;
        $arr[$i]=$sky[($i%10+6)%10] . $land[($i%12+8)%12];
    }

    // echo "<pre>" ;print_r($arr);echo "</pre>";

    echo $year . "是" . $arr[$year]. "年";
    


?>

<h4>天干地支年別2</h4>
<!-- 位移天干地支 的位置 -->
<?php 
    $start=1024;

    $sky=[
         "庚", "辛", "壬", "癸","甲", "乙", "丙", "丁", "戊", "己", 
    ];
     $land=[
         '申', '酉', '戌', '亥','子', '丑', '寅', '卯', '辰', '巳', '午', '未', 
     ];
     $year=2020;
 
     $arr=[];
     for ($i=1024; $i < 3000; $i++) { 
         // $arr[]=$i;
         $arr[$i]=$sky[$i%10] . $land[$i%12];
     }
 
     // echo "<pre>" ;print_r($arr);echo "</pre>";
 
     echo $year . "是" . $arr[$year]. "年";
     



?>
