<?php
//學生成績資料
$score=[
    "01"=>[
        "國文"=>99,
        "英文"=>88,
        "數學"=>77
    ],
    "12"=>[
        "國文"=>66,
        "英文"=>55,
        "數學"=>44
    ],
    "33"=>[
        "國文"=>76,
        "英文"=>24,
        "數學"=>89
    ],
    "07"=>[
        "國文"=>90,
        "英文"=>22,
        "數學"=>39
    ],
    "24"=>[
        "國文"=>76,
        "英文"=>53,
        "數學"=>49
    ],

];


if(isset($_GET['num'])) {
    $num=$_GET['num'];
    echo "座號：" . $num . "的成績： <br>";
    echo "國文成績：" . $score[$num]["國文"] . "分 <br>"; 
    echo "英文成績：" . $score[$num]["英文"] . "分 <br>";
    echo "數學成績：" . $score[$num]["數學"] . "分 <br>";
}else{
    echo "!!請提供學生座號";
};

?>

<a href="student.html">回學生列表</a>